src/cf/InformationRegisters/СоответствияПользователейСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СоответствияПользователейСистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Зарегистрирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипИдентификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИдентификацииСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыСообщенийTelegramBot.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыСообщенийTelegramBot</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клавиатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеКнопок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаФото</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаАудио</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаВидео</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаАнимации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаГолосовогоСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаВидеоСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаГруппыМедиаФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаЛокации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаКонтакта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаОпроса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаКубика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеОбновлений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисвоитьКоманды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисвоитьВебХук</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаСтикера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Авторизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланированиеВидеоЧата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоВидеоЧата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияОЧате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонецВидеоЧата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыПредопределенныхОтветовБота.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыПредопределенныхОтветовБота</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыборВариантаАвторизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросТелефона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОповещениеОПодтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстПодтвержденияАвторизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НекорректныйКод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросФИО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОповещениеОтветственныхОНовом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОповещениеОтветственныхОбОкончании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедоступностьФункционала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстПодсказкиОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомандаНедоступнаВInlineMode</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстОповещенияНачалоВидеоЧата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстОповещенияКонецВидеоЧата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Боты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Боты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тэг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБота</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыБотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Команды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомандыБотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторБота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновленияРеглЗаданием</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РесурсОбновления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РесурсыREST</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмОтветаНаСоощения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользовательскиеФункции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредопределенныеОтветы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОтвета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПредопределенныхОтветовБота</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/СоответствияПользователейСистем/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтборов = Новый Структура;
	СтруктураОтборов.Вставить("НастройкаИнтеграции"	, Отбор.НастройкаИнтеграции.Значение);
	СтруктураОтборов.Вставить("ТипИдентификации"	, Отбор.ТипИдентификации.Значение);
	СтруктураОтборов.Вставить("ЗначениеСистемы"		, Отбор.ЗначениеСистемы.Значение);
	
	ИмяИсточника = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(
		Новый Структура("Пользователь, Отборы", ИмяПользователя(), СтруктураОтборов));
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		
		ОбщегоНазначения.СкопироватьВБуферОбмена(ПолучитьНачальныеДанные(СтруктураОтборов), ИмяИсточника);
		
	Иначе
		
		БуферОбмена = ОбщегоНазначения.СтрокиИзБуфераОбмена();
		Если БуферОбмена.Источник = ИмяИсточника Тогда
			НачальныеДанные = БуферОбмена.Данные;
		Иначе
			НачальныеДанные = Неопределено;
		КонецЕсли;
		
		Если НачальныеДанные <> Неопределено Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ЗаписиДоИзменения"	, НачальныеДанные);
			Запрос.УстановитьПараметр("ЗаписиПослеИзменения", Выгрузить());
			Запрос.Текст = "ВЫБРАТЬ
			|	ЗаписиДоИзменения.НастройкаИнтеграции КАК НастройкаИнтеграции,
			|	ЗаписиДоИзменения.ТипИдентификации КАК ТипИдентификации,
			|	ЗаписиДоИзменения.ЗначениеСистемы КАК ЗначениеСистемы
			|ПОМЕСТИТЬ ВТЗаписиДоИзменения
			|ИЗ
			|	&ЗаписиДоИзменения КАК ЗаписиДоИзменения
			|ГДЕ
			|	НЕ ЗаписиДоИзменения.Зарегистрирован
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаписиПослеИзменения.НастройкаИнтеграции КАК НастройкаИнтеграции,
			|	ЗаписиПослеИзменения.ТипИдентификации КАК ТипИдентификации,
			|	ЗаписиПослеИзменения.ЗначениеСистемы КАК ЗначениеСистемы,
			|	ЗаписиПослеИзменения.Пользователь КАК Пользователь
			|ПОМЕСТИТЬ ВТЗаписиПослеИзменения
			|ИЗ
			|	&ЗаписиПослеИзменения КАК ЗаписиПослеИзменения
			|ГДЕ
			|	ЗаписиПослеИзменения.Зарегистрирован
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Боты.Ссылка КАК Бот,
			|	ВТЗаписиПослеИзменения.НастройкаИнтеграции КАК НастройкаИнтеграции,
			|	ВТЗаписиПослеИзменения.ЗначениеСистемы КАК Получатель,
			|	ВТЗаписиПослеИзменения.Пользователь.Наименование КАК ИмяПользователя
			|ИЗ
			|	ВТЗаписиПослеИзменения КАК ВТЗаписиПослеИзменения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаписиДоИзменения КАК ВТЗаписиДоИзменения
			|		ПО (ВТЗаписиПослеИзменения.НастройкаИнтеграции = ВТЗаписиДоИзменения.НастройкаИнтеграции
			|			И ВТЗаписиПослеИзменения.ТипИдентификации = ВТЗаписиДоИзменения.ТипИдентификации
			|			И ВТЗаписиПослеИзменения.ЗначениеСистемы = ВТЗаписиДоИзменения.ЗначениеСистемы)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Боты КАК Боты
			|		ПО ВТЗаписиПослеИзменения.НастройкаИнтеграции = Боты.НастройкаИнтеграции";
			
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
			
			ПодтвердившийПользователь = Пользователи.АвторизованныйПользователь();
			МассивПодтверждающих = ОбщегоНазначенияУПОСервер.ПолучитьПредопределенноеЗначение(
				"ОтветственныеПодтверждающиеРегистрациюПользователейБота");
			ИндексПодтвердившего = МассивПодтверждающих.Найти(ПодтвердившийПользователь);
			Если ИндексПодтвердившего <> Неопределено Тогда
				МассивПодтверждающих.Удалить(ИндексПодтвердившего);
			КонецЕсли;
			
			Если ВыборкаРезультатаЗапроса.Следующий() Тогда
				
				РегистрыСведений.СоответствияПользователейСистем.ОповеститьПользователяОбОкончанииРегистрации(
					ВыборкаРезультатаЗапроса.Бот, ВыборкаРезультатаЗапроса.НастройкаИнтеграции, ВыборкаРезультатаЗапроса.Получатель);
				
				ДанныеСообщения = Новый Структура;
				ДанныеСообщения.Вставить("ТипСообщения"	, Перечисления.ТипыСообщенийTelegramBot.ОтправкаСообщения);
				ШаблонСообщения = ИнтеграцияСБотамиСлужебныйСервер.ПолучитьТекстСообщенияПредопределенногоОтвета(
					ВыборкаРезультатаЗапроса.Бот, Перечисления.ТипыПредопределенныхОтветовБота.ОповещениеОтветственныхОбОкончании);
				ТекстСообщения = СтрШаблон(ШаблонСообщения,
					ВыборкаРезультатаЗапроса.ИмяПользователя,
					ПодтвердившийПользователь);
				ДанныеСообщения.Вставить("Содержимое", ТекстСообщения);
				
				Для Каждого ЭлементПолучатель Из МассивПодтверждающих Цикл
					Результат = ИнтеграцияСБотамиСервер.ВыполнитьОтправкуСообщения(ВыборкаРезультатаЗапроса.Бот, ДанныеСообщения, ЭлементПолучатель);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// очистим буфер обмена
		ОбщегоНазначения.СкопироватьВБуферОбмена(Неопределено, ИмяИсточника);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьНачальныеДанные(СтруктураОтборов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствияПользователейСистем.НастройкаИнтеграции КАК НастройкаИнтеграции,
	|	СоответствияПользователейСистем.ТипИдентификации КАК ТипИдентификации,
	|	СоответствияПользователейСистем.ЗначениеСистемы КАК ЗначениеСистемы,
	|	СоответствияПользователейСистем.Пользователь КАК Пользователь,
	|	СоответствияПользователейСистем.Зарегистрирован КАК Зарегистрирован
	|ИЗ
	|	РегистрСведений.СоответствияПользователейСистем КАК СоответствияПользователейСистем
	|ГДЕ
	|	СоответствияПользователейСистем.НастройкаИнтеграции = &НастройкаИнтеграции
	|	И СоответствияПользователейСистем.ТипИдентификации = &ТипИдентификации
	|	И СоответствияПользователейСистем.ЗначениеСистемы = &ЗначениеСистемы";
	
	Для Каждого КлючИЗначение Из СтруктураОтборов Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'; en = 'Invalid object call on client.'");
#КонецЕсли
